#############################################################################
##
#W  attr.xml
#Y  Copyright (C) 2014                                  James D. Mitchell
##
##  Licensing information can be found in the README file of this package.
##
#############################################################################
##

<#GAPDoc Label="DigraphDual">
<ManSection>
  <Attr Name="DigraphDual" Arg="digraph"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>digraph</A> does not have multiple edges, then this method returns the
    dual of <A>digraph</A>. <P/> 
    
    The <E>dual</E> of a digraph <A>digraph</A> has the same vertices as
    <A>digraph</A> and there is an edge in the dual from <C>i</C> to <C>j</C>
    whenever there is no edge from <C>i</C> to <C>j</C> in <A>digraph</A>.
    <Example><![CDATA[
gap> gr:=Digraph([[2,3], [],[4,6], [5], [], [7,8,9], [],[],[]]);
<digraph with 9 vertices, 8 edges>
gap> DigraphDual(gr);
<digraph with 9 vertices, 73 edges>]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="DigraphTopologicalSort">
<ManSection>
  <Attr Name="DigraphTopologicalSort" Arg="digraph"/>
  <Returns>A list of positive integers, or <K>fail</K>.</Returns>
  <Description>
    If <A>digraph</A> is a digraph with no cycles of length greater than
    <M>1</M>, then this operation returns the vertices of <A>digraph</A> 
    ordered so that every vertex adjacent to <C>i</C> occurs before <C>i</C>. 
    If the digraph <A>digraph</A> contains cycles of length greater than 
    <M>1</M>, then this operation returns <K>fail</K>.
    <P/>

    The method used in this operation has complexity <M>O(m+n)</M> where
    <M>m</M> is the number of edges (counting multiple edges as one) and
    <M>n</M> is the number of vertices in the digraph. 
    <Example><![CDATA[
gap> gr:=Digraph([[2,3], [],[4,6], [5], [], [7,8,9], [],[],[]]);
<digraph with 9 vertices, 8 edges>
gap> DigraphTopologicalSort(gr);
[ 2, 5, 4, 7, 8, 9, 6, 3, 1 ]
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="AdjacencyMatrix">
<ManSection>
  <Attr Name="AdjacencyMatrix" Arg="digraph"/>
  <Returns>The adjacency matrix of a digraph.</Returns>
  <Description>
    Returns adjacency matrix <C>mat</C> of the digraph <A>digraph</A>.
    The value of <C>mat[i][j]</C> is the number of edges from the vertex
    <C>i</C> to the vertex <C>j</C> in <A>digraph</A>.
    
    <Example><![CDATA[
gap> gr:=Digraph( [ [ 2 ], [ 1, 3, 6, 8, 9, 10 ], [ 4, 6, 8 ], 
> [ 1, 2, 3, 9 ], [ 3 ], [ 3, 5, 6, 10 ], 
> [ 1, 2, 7 ], [ 1, 2, 3, 5, 6, 10 ], [ 1, 3, 4, 5, 8, 10 ], 
> [ 2, 3, 4, 6, 7, 10 ] ] );;
gap> AdjacencyMatrix(gr);
[ [ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0 ], [ 1, 0, 1, 0, 0, 1, 0, 1, 1, 1 ], 
  [ 0, 0, 0, 1, 0, 1, 0, 1, 0, 0 ], [ 1, 1, 1, 0, 0, 0, 0, 0, 1, 0 ], 
  [ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0 ], [ 0, 0, 1, 0, 1, 1, 0, 0, 0, 1 ], 
  [ 1, 1, 0, 0, 0, 0, 1, 0, 0, 0 ], [ 1, 1, 1, 0, 1, 1, 0, 0, 0, 1 ], 
  [ 1, 0, 1, 1, 1, 0, 0, 1, 0, 1 ], [ 0, 1, 1, 1, 0, 1, 1, 0, 0, 1 ] ]]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="RangeSourceDigraph">
<ManSection>
  <Attr Name="DigraphRange" Arg="digraph"/>
  <Attr Name="DigraphSource" Arg="digraph"/>
  <Returns>A list of positive integers.</Returns>
  <Description>
    <C>DigraphRange</C> and <C>DigraphSource</C> return the range and source of
    the directed graph <A>digraph</A>. More precisely, position <C>i</C> in
    <C>DigraphRange(<A>digraph</A>)</C> is the range of the <C>i</C>th edge of
    <A>digraph</A>. 

    <Example><![CDATA[
gap> gr:=Digraph( [ [ 1, 2, 3, 5 ], [ 1, 3, 4 ], [ 2, 3 ], 
> [ 2 ], [ 1, 2, 3, 4 ] ] );
<digraph with 5 vertices, 14 edges>
gap> DigraphRange(gr);
[ 1, 2, 3, 5, 1, 3, 4, 2, 3, 2, 1, 2, 3, 4 ]
gap> DigraphSource(gr);
[ 1, 1, 1, 1, 2, 2, 2, 3, 3, 4, 5, 5, 5, 5 ]
gap> DigraphEdges(gr);
[ [ 1, 1 ], [ 1, 2 ], [ 1, 3 ], [ 1, 5 ], [ 2, 1 ], [ 2, 3 ], 
  [ 2, 4 ], [ 3, 2 ], [ 3, 3 ], [ 4, 2 ], [ 5, 1 ], [ 5, 2 ], 
  [ 5, 3 ], [ 5, 4 ] ]
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="DigraphEdges">
<ManSection>
  <Attr Name="DigraphEdges" Arg="digraph"/>
  <Returns>The edges of a digraph.</Returns>
  <Description>
    Returns the set of edges of the digraph <A>digraph</A>, that is, a set of
    pairs of elements of <Ref Oper="DigraphVertices"/>.
    <Example><![CDATA[
gap> gr:= Digraph( [ [ 1, 3, 4, 5 ], [ 1, 2, 3, 5 ], [ 2, 4, 5 ], 
> [ 2, 4, 5 ], [ 1 ] ] );
<digraph with 5 vertices, 15 edges>
gap> DigraphEdges(gr);
[ [ 1, 1 ], [ 1, 3 ], [ 1, 4 ], [ 1, 5 ], [ 2, 1 ], [ 2, 2 ], 
  [ 2, 3 ], [ 2, 5 ], [ 3, 2 ], [ 3, 4 ], [ 3, 5 ], [ 4, 2 ], 
  [ 4, 4 ], [ 4, 5 ], [ 5, 1 ] ]
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="DigraphNrEdges">
<ManSection>
  <Attr Name="DigraphNrEdges" Arg="digraph"/>
  <Returns>The number of edges of a digraph.</Returns>
  <Description>
    Returns the number of edges of the digraph <A>digraph</A>.
    <Example><![CDATA[
gap> gr:= Digraph( [ [ 1, 3, 4, 5 ], [ 1, 2, 3, 5 ], [ 2, 4, 5 ], 
> [ 2, 4, 5 ], [ 1 ] ] );;
gap> DigraphNrEdges(gr);
15
gap> gr:=Digraph(rec(vertices:=["a", "b", "c"],
> source:=["a", "b", "b"], range:=["b", "a", "a"]));
<multidigraph with 3 vertices, 3 edges>
gap> DigraphNrEdges(gr);
3]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="OutNeighbours">
<ManSection>
  <Attr Name="OutNeighbours" Arg="digraph"/>
  <Attr Name="OutNeighbors" Arg="digraph"/>
  <Returns>The adjacencies of a digraph.</Returns>
  <Description>
    Returns the list <C>out</C> of out-neighbours of the digraph
    <A>digraph</A>. More specifically, <C>j</C> belongs to <C>out[i]</C>
    whenever there is an edge from <C>i</C> to <C>j</C> in <A>digraph</A>. <P/>

    <Example><![CDATA[
gap> gr:=Digraph(rec(vertices:=["a", "b", "c"],
> source:=["a", "b", "b"], range:=["b", "a", "c"]));
<digraph with 3 vertices, 3 edges>
gap> OutNeighbours(gr);
[ [ 2 ], [ 1, 3 ], [  ] ]
gap> gr:=Digraph(rec(vertices:=[1..3], 
> source:=[1,2,3,1,1,2], range:=[1,2,3,2,3,1]));
<digraph with 3 vertices, 6 edges>
gap> OutNeighbours(gr);
[ [ 1, 2, 3 ], [ 2, 1 ], [ 3 ] ]
gap> gr:=Digraph(rec(vertices:=[1..3],
> source:=[1,2,3,1,1,2,1], range:=[1,2,3,2,3,1,2]));
<multidigraph with 3 vertices, 7 edges>
gap> OutNeighbours(gr);
[ [ 1, 2, 3, 2 ], [ 2, 1 ], [ 3 ] ]
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="InNeighbours">
<ManSection>
  <Attr Name="InNeighbours" Arg="digraph"/>
  <Attr Name="InNeighbors" Arg="digraph"/>
  <Returns>A list of in-neighbours of a digraph.</Returns>
  <Description>
    Returns the list <C>in</C> of in-neighbours of the digraph
    <A>digraph</A>. More specifically, <C>j</C> belongs to <C>in[i]</C>
    whenever there is an edge from <C>j</C> to <C>i</C> in <A>digraph</A>. <P/>

    Note that each entry of <C>in</C> is sorted into ascending order.
<P/>

    <Example><![CDATA[
gap> gr := Digraph( rec( vertices := [ "a", "b", "c" ],
> source := [ "a", "b", "b" ], range := [ "b", "a", "c" ] ) );
<digraph with 3 vertices, 3 edges>
gap> InNeighbours(gr);
[ [ 2 ], [ 1 ], [ 2 ] ]
gap> gr := Digraph( rec( vertices := [ 1 .. 3 ], 
> source := [ 1, 2, 3, 1, 1, 2 ], range := [ 1, 2, 3, 2, 3, 1 ] ) );
<digraph with 3 vertices, 6 edges>
gap> InNeighbours(gr);
[ [ 1, 2 ], [ 1, 2 ], [ 1, 3 ] ]
gap> gr := Digraph( rec( vertices := [ 1 .. 3 ],
> source := [ 1, 2, 3, 1, 1, 2, 1 ], range := [ 1, 2, 3, 2, 3, 1, 2 ] ) );
<multidigraph with 3 vertices, 7 edges>
gap> InNeighbours(gr);
[ [ 1, 2 ], [ 1, 1, 2 ], [ 1, 3 ] ]
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="DigraphVertices">
<ManSection>
  <Oper Name="DigraphVertices" Arg="digraph"/>
  <Returns>The vertices of a digraph.</Returns>
  <Description>
    Returns the vertices of the digraph <A>digraph</A>. <P/>

    <B>Note that:</B> the vertices of a digraph are always a range of
    positive integers from <C>1</C> to the number of vertices of the graph. 
    <Example><![CDATA[
gap> gr:=Digraph(rec(vertices:=["a", "b", "c"],
> source:=["a", "b", "b"], range:=["b", "c", "a"]));
<digraph with 3 vertices, 3 edges>
gap> DigraphVertices(gr);
[ 1 .. 3 ]
gap> gr:=Digraph(rec(vertices:=[1,2,3,4,5,7],
> source:=[1,2,2,4,4], range:=[2,3,5,3,5]));
<digraph with 6 vertices, 5 edges>
gap> DigraphVertices(gr);
[ 1 .. 6 ]
gap> DigraphVertices(RandomDigraph(100));
[ 1 .. 100 ]
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="DigraphNrVertices">
<ManSection>
  <Attr Name="DigraphNrVertices" Arg="digraph"/>
  <Returns>The number of vertices of a digraph.</Returns>
  <Description>
    Returns the number of vertices of the digraph <A>digraph</A>. <P/>

    <Example><![CDATA[
gap> gr:=Digraph(rec(vertices:=["a", "b", "c"],
> source:=["a", "b", "b"], range:=["b", "c", "a"]));
<digraph with 3 vertices, 3 edges>
gap> DigraphNrVertices(gr);
3
gap> gr:=Digraph(rec(vertices:=[1,2,3,4,5,7],
> source:=[1,2,2,4,4], range:=[2,3,5,3,5]));
<digraph with 6 vertices, 5 edges>
gap> DigraphNrVertices(gr);
6
gap> DigraphNrVertices(RandomDigraph(100));
100]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="DigraphStronglyConnectedComponents">
<ManSection>
  <Attr Name="DigraphStronglyConnectedComponents" Arg="digraph"/>
  <Returns>A record.</Returns>
  <Description>
    Returns the record <C>scc</C> corresponding to the strongly connected
    components of the digraph <A>digraph</A>. The record <C>scc</C> has 2
    components <C>comps</C> and <C>id</C>. The component <C>comps</C> is a list
    of the strongly connected components of <A>digraph</A> (as a list of
    vertices) and <C>id</C> is a list such that the vertex <C>i</C> is an
    element of <C>comps[id[i]]</C>.<P/>

    The method used in this operation is a non-recursive version of Gabow's
    Algorithm <Cite Key="Gabow2000aa"/> and has complexity <M>O(m+n)</M> where
    <M>m</M> is the number of edges (counting multiple edges as one) and
    <M>n</M> is the number of vertices in the digraph. 
    
    <Example><![CDATA[
gap> gr:=Digraph(rec(vertices:=["a", "b", "c"],
> source:=["a", "b", "b"], range:=["b", "c", "a"]));
<digraph with 3 vertices, 3 edges>
gap> DigraphStronglyConnectedComponents(gr);
rec( comps := [ [ 3 ], [ 1, 2 ] ], id := [ 2, 2, 1 ] )
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

#

<#GAPDoc Label="DigraphConnectedComponents">
<ManSection>
  <Attr Name="DigraphConnectedComponents" Arg="digraph"/>
  <Returns>A record.</Returns>
  <Description>
    Returns the record <C>wcc</C> corresponding to the weakly connected
    components of the digraph <A>digraph</A>. The record <C>wcc</C> has 2
    components <C>comps</C> and <C>id</C>. The component <C>comps</C> is a list
    of the weakly connected components of <A>digraph</A> (as a list of
    vertices) and <C>id</C> is a list such that the vertex <C>i</C> is an
    element of <C>comps[id[i]]</C>.<P/>

    The method used in this operation has complexity <M>O(m+n)</M> where
    <M>m</M> is the number of edges (counting multiple edges as one) and
    <M>n</M> is the number of vertices in the digraph. 
    
    <Example><![CDATA[
gap> gr:=Digraph(rec(vertices:=["a", "b", "c"],
> source:=["a", "b", "b"], range:=["b", "c", "a"]));
<digraph with 3 vertices, 3 edges>
gap> DigraphConnectedComponents(gr);
rec( comps := [ [ 1, 2, 3 ] ], id := [ 1, 1, 1 ] )
gap> gr := Digraph( [ [ 1 ], [ 1, 2 ], [ ] ] );
<digraph with 3 vertices, 3 edges>
gap> DigraphConnectedComponents(gr);
rec( comps := [ [ 1, 2 ], [ 3 ] ], id := [ 1, 1, 2 ] )
gap> gr := Digraph( [ ] );
<digraph with 0 vertices, 0 edges>
gap> DigraphConnectedComponents(gr);
rec( comps := [  ], id := [  ] )
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

#

<#GAPDoc Label="DigraphShortestDistances">
<ManSection>
  <Attr Name="DigraphShortestDistances" Arg="digraph"/>
  <Returns>A matrix.</Returns>
  <Description>
    If <A>digraph</A> is a digraph with <M>n</M> vertices, then this function 
    returns an <M>n \times n</M> matrix <C>mat</C>. If a directed path from 
    vertex <C>i</C> to vertex <C>j</C> exists, then the value of 
    <C>mat[i][j]</C> is the length of the shortest such path (allowing paths of 
    length zero). If no such path exists, then the value of <C>mat[i][j]</C> is 
    <C>infinity</C>. If <M>n = 0</M>, then an empty list is returned. <P/>

    The method used in this function is a version of the Floyd-Warshall 
    algorithm, and has complexity <M>O(n^3)</M>.
    
    <Example><![CDATA[
gap> gr := Digraph( [ [ 1, 2 ], [ 3 ], [ 1, 2 ], [ 4 ] ] );
<digraph with 4 vertices, 6 edges>
gap> mat := DigraphShortestDistances(gr);;
gap> Display(mat);
[ [         0,         1,         2,  infinity ],
  [         2,         0,         1,  infinity ],
  [         1,         1,         0,  infinity ],
  [  infinity,  infinity,  infinity,         0 ] ]
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

