#############################################################################
##
#W  bliss.xml
#Y  Copyright (C) 2014                                  James D. Mitchell
##
##  Licensing information can be found in the README file of this package.
##
#############################################################################
##

<#GAPDoc Label="AutomorphismGroupDigraph">
<ManSection>
  <Attr Name="AutomorphismGroup" Label="for a digraph" Arg="digraph"/>
  <Description>
    If <A>digraph</A> is a digraph without multiple edges, then this function
    returns the automorphism group of <A>digraph</A>, as a group of permutations
    on the vertices of <A>digraph</A>. <P/>

    The automorphism group is found using <URL
      Text="bliss">http://www.tcs.tkk.fi/Software/bliss/index.html</URL> by
    Tommi Junttila and Petteri Kaski.

    <Example><![CDATA[
gap> johnson := Digraph( [ [ 2, 3, 4, 5 ], [ 1, 3, 4, 6 ], 
> [ 1, 2, 5, 6 ], [ 1, 2, 5, 6 ], [ 1, 3, 4, 6 ], 
> [ 2, 3, 4, 5 ] ] );
<digraph with 6 vertices, 24 edges>
gap> AutomorphismGroup(johnson);
Group([ (3,4), (2,3)(4,5), (1,2)(5,6) ])
gap> Size(last);
48]]></Example>
    </Description>
  </ManSection>
  <#/GAPDoc>

  <#GAPDoc Label="AutomorphismGroupMultiDigraph">
  <ManSection>
    <Attr Name="AutomorphismGroup" Label="for a multidigraph" Arg="digraph"/>
    <Description>
    If <A>digraph</A> is a multidigraph, then this function
    returns the automorphism group of <A>digraph</A>, as a group of permutations
    on the vertices and edges of <A>digraph</A>.<P/>

    For convenience, the returned group is the direct product of the group of
    automorphisms of the vertices of <A>digraph</A> with the stabiliser of the
    vertices in the automorphism group of the edges. These two groups can be
    accessed using the <Ref Oper="Projection" BookName="ref"/> with second
    argument <C>1</C> and <C>2</C>, respectively. 
    <P/>

    The permutations in the automorphism group of the edges act on the indices
    of the edges of <A>digraph</A>.<P/>

    The automorphism group is found using <URL
      Text="bliss">http://www.tcs.tkk.fi/Software/bliss/index.html</URL> by
    Tommi Junttila and Petteri Kaski.

    <Example><![CDATA[
gap> gr:=DigraphEdgeUnion(CycleDigraph(3), CycleDigraph(3));          
<multidigraph with 3 vertices, 6 edges>
gap> G:=AutomorphismGroup(gr);
Group([ (1,2,3), (8,9), (6,7), (4,5) ])
gap> Range(Projection(G, 1));
Group([ (1,2,3) ])
gap> Range(Projection(G, 2));
Group([ (5,6), (3,4), (1,2) ])
gap> Size(G);
24]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="DigraphEndomorphisms">
<ManSection>
  <Attr Name="DigraphEndomorphisms" Label="for a digraph" Arg="digraph"/>
  <Description>

  <Example><![CDATA[
  ]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="DigraphCanonicalLabelling">
<ManSection>
  <Attr Name="DigraphCanonicalLabelling" Label="for a digraph" Arg="digraph"/>
  <Description>

  <Example><![CDATA[
  ]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="IsIsomorphicDigraph">
<ManSection>
  <Oper Name="IsIsomorphicDigraph" Label="for a digraph" Arg="digraph"/>
  <Description>

  <Example><![CDATA[
  ]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="IsomorphismDigraphs">
<ManSection>
  <Oper Name="IsomorphismDigraphs" Label="for a digraph" Arg="digraph"/>
  <Description>

  <Example><![CDATA[
  ]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="EndomorphismMonoid">
<ManSection>
  <Attr Name="EndomorphismMonoid" Label="for a digraph" Arg="digraph"/>
  <Description>

  <Example><![CDATA[
  ]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

